app/controllers/posts_controller.rb

  def index
    logger.debug("index posts")

    if params[:user_id]
      @posts = Post.find(:all, :conditions => ['author_id = ?', params[:user_id]])
    else
      @posts = Post.all
---
SELECT * FROM "posts" WHERE (author_id = '2')
SELECT * FROM "posts"

  def show
    logger.debug("show time")
    @post = Post.find(params[:id])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)

  def new
    logger.debug("Post")

    @post = Post.new
    @user = User.find(:first, :conditions => ['login = ?',session[:user_id]])
---
SELECT * FROM "users" WHERE (login = 'ariel') LIMIT 1

  def create
    #@post = Post.new(params[:post].delete('tags'))
    #@post = Post.new({:title => params[:post][:title], :content => params[:post][:content]})
    @post = Post.new(params[:post])
    @user = User.find(:first, :conditions => ['login = ?',session[:user_id]])

    #user management
    @post.author = @user

    # tags management
    if params[:tags]
      params[:tags].split(',').each { |tag|
        logger.debug("tag: " + tag.strip)
        tag = tag.strip
        if Tag.count(:conditions => {:name => tag}) == 0
          @tag=Tag.create(:name => tag)
        else
          @tag=Tag.find(:first, :conditions => {:name => tag.strip})
        end
        if @post.save
---
SELECT * FROM "users" WHERE (login = 'ariel') LIMIT 1
SELECT * FROM "tags" WHERE ("tags"."name" = 'rails') LIMIT 1
SELECT count(*) AS count_all FROM "tags" WHERE ("tags"."name" = 'rails')
INSERT INTO "tags" ("post_id", "updated_at", "created_at", "subscriber_id", "name", "subscriber_type") VALUES(NULL, '2012-08-22 09:37:13', '2012-08-22 09:37:13', NULL, 'football', 'User')
INSERT INTO "posts" ("updated_at", "content", "author_id", "title", "created_at", "tag_id", "suggested_tag_id", "author_type") VALUES('2012-08-21 15:59:55', 'A session id consists of the hash value of a random string. The random string is the current time, a random number between 0 and 1, the process id number of the Ruby interpreter (also basically a random number) and a constant string. Currently it is not feasible to brute-force Rails’ session ids. To date MD5 is uncompromised, but there have been collisions, so it is theoretically possible to create another input text with the same hash value. But this has had no security impact to date.', NULL, 'Named Routes', '2012-08-21 15:59:55', NULL, NULL, 'User')

  def edit
    @post = Post.find(params[:id])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 6)

  def update
    @post = Post.find(params[:id])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 6)

  def destroy
    @post = Post.find(params[:id])
    @post.destroy
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)
DELETE FROM "posts" WHERE "id" = 1