app/controllers/sessions_controller.rb

SELECT * FROM "users" WHERE (login = 'params[:login]')
---
  def new
    user = User.find(:first, :conditions => ['login = ?',params[:login]])