app/controllers/tags_controller.rb

SELECT "posts".id FROM "posts" WHERE ("posts"."id" = '1') LIMIT 1
SELECT * FROM "tags" INNER JOIN "posts_tags" ON "tags".id = "posts_tags".tag_id WHERE ("posts_tags".post_id = 1 )
SELECT * FROM "tags"
---
  def index
    logger.debug("fdafdas")
    if params[:post_id] && Post.exists?(params[:post_id])
      @tags = Post.find(params[:post_id]).tags
     else
      @tags = Tag.all

SELECT * FROM "tags" WHERE ("tags"."id" = 1)
---
  def show
    logger.debug("show time")
    #@tag = Tag.find(:conditions => {:name => params[:id]})
    @tag = Tag.find(params[:id])

SELECT * FROM "users" WHERE (login = 'ariel') LIMIT 1
SELECT * FROM "tags" WHERE ("tags"."id" = 1)
---
  def subscribe
    logger.debug("subscribe")
    @user = User.find(:first, :conditions => ['login = ?',session[:user_id]])
    @tag = Tag.find(params[:id])