app/controllers/users_controller.rb

  def index
    logger.debug("index users")
    @users = User.all
---
SELECT * FROM "users" WHERE (login = 'test') LIMIT 1

  def show
    logger.debug("show user")
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE (login = 'test') LIMIT 1

  def create
    logger.debug("AAA " + params[:user][:password])

    @user = User.new(params[:user])
    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("post_id", "updated_at", "login", "subscription_id", "subscription_type", "last_visit", "password", "created_at", "name", "tag_id", "suggested_tag_id") VALUES(NULL, '2012-08-22 09:36:35', 'ariel', NULL, 'Tag', NULL, 'ariel', '2012-08-22 09:36:35', 'ariel', NULL, NULL)

  def edit
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)

  def update
    @user = User.find(params[:id])


    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)
UPDATE "users" SET "password" = 'ariel2', "updated_at" = '2012-08-21 10:13:22' WHERE "id" = 1

  def destroy
    @user = User.find(params[:id])
    @user.destroy
---
SELECT * FROM "users" WHERE ("users"."id" = 2)
DELETE FROM "users" WHERE "id" = 2